dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/pin_packages/cy_hal_psoc6_02_68_qfn.c
/* Connections for: audioss_tx_ws */
const cy_resource_pin_mapping_t cy_pin_map_audioss_tx_ws[2] = {
    {P9_2, &CY_I2S_0, CY_PIN_OUT_FUNCTION(P9_2_AUDIOSS0_TX_WS)},
    {P11_2, &CY_I2S_1, CY_PIN_OUT_FUNCTION(P11_2_AUDIOSS1_TX_WS)},
};

/* Connections for: scb_i2c_scl */
const cy_resource_pin_mapping_t cy_pin_map_scb_i2c_scl[12] = {
    {P0_2, &CY_SCB_0, CY_PIN_OD_FUNCTION(P0_2_SCB0_I2C_SCL)},
    {P2_0, &CY_SCB_1, CY_PIN_OD_FUNCTION(P2_0_SCB1_I2C_SCL)},
    {P2_4, &CY_SCB_9, CY_PIN_OD_FUNCTION(P2_4_SCB9_I2C_SCL)},
    {P3_0, &CY_SCB_2, CY_PIN_OD_FUNCTION(P3_0_SCB2_I2C_SCL)},
    {P5_0, &CY_SCB_5, CY_PIN_OD_FUNCTION(P5_0_SCB5_I2C_SCL)},
    {P6_4, &CY_SCB_6, CY_PIN_OD_FUNCTION(P6_4_SCB6_I2C_SCL)},
    {P6_4, &CY_SCB_8, CY_PIN_OD_FUNCTION(P6_4_SCB8_I2C_SCL)},
    {P7_0, &CY_SCB_4, CY_PIN_OD_FUNCTION(P7_0_SCB4_I2C_SCL)},
    {P8_0, &CY_SCB_4, CY_PIN_OD_FUNCTION(P8_0_SCB4_I2C_SCL)},
    {P9_0, &CY_SCB_2, CY_PIN_OD_FUNCTION(P9_0_SCB2_I2C_SCL)},
    {P10_0, &CY_SCB_1, CY_PIN_OD_FUNCTION(P10_0_SCB1_I2C_SCL)},
    {P11_0, &CY_SCB_5, CY_PIN_OD_FUNCTION(P11_0_SCB5_I2C_SCL)},
};

/* Connections for: scb_i2c_sda */
const cy_resource_pin_mapping_t cy_pin_map_scb_i2c_sda[12] = {
    {P0_3, &CY_SCB_0, CY_PIN_OD_FUNCTION(P0_3_SCB0_I2C_SDA)},
    {P2_1, &CY_SCB_1, CY_PIN_OD_FUNCTION(P2_1_SCB1_I2C_SDA)},
    {P2_5, &CY_SCB_9, CY_PIN_OD_FUNCTION(P2_5_SCB9_I2C_SDA)},
    {P3_1, &CY_SCB_2, CY_PIN_OD_FUNCTION(P3_1_SCB2_I2C_SDA)},
    {P5_1, &CY_SCB_5, CY_PIN_OD_FUNCTION(P5_1_SCB5_I2C_SDA)},
    {P6_5, &CY_SCB_6, CY_PIN_OD_FUNCTION(P6_5_SCB6_I2C_SDA)},
    {P6_5, &CY_SCB_8, CY_PIN_OD_FUNCTION(P6_5_SCB8_I2C_SDA)},
    {P7_1, &CY_SCB_4, CY_PIN_OD_FUNCTION(P7_1_SCB4_I2C_SDA)},
    {P8_1, &CY_SCB_4, CY_PIN_OD_FUNCTION(P8_1_SCB4_I2C_SDA)},
    {P9_1, &CY_SCB_2, CY_PIN_OD_FUNCTION(P9_1_SCB2_I2C_SDA)},
    {P10_1, &CY_SCB_1, CY_PIN_OD_FUNCTION(P10_1_SCB1_I2C_SDA)},
    {P11_1, &CY_SCB_5, CY_PIN_OD_FUNCTION(P11_1_SCB5_I2C_SDA)},
};

/* Connections for: scb_spi_clk */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_clk[10] = {
    {P0_4, &CY_SCB_0, CY_PIN_OUT_FUNCTION(P0_4_SCB0_SPI_CLK)},
    {P2_2, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P2_2_SCB1_SPI_CLK)},
    {P6_2, &CY_SCB_3, CY_PIN_OUT_FUNCTION(P6_2_SCB3_SPI_CLK)},
    {P6_2, &CY_SCB_8, CY_PIN_OUT_FUNCTION(P6_2_SCB8_SPI_CLK)},
    {P6_6, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P6_6_SCB6_SPI_CLK)},
    {P6_6, &CY_SCB_8, CY_PIN_OUT_FUNCTION(P6_6_SCB8_SPI_CLK)},
    {P7_2, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P7_2_SCB4_SPI_CLK)},
    {P9_2, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P9_2_SCB2_SPI_CLK)},
    {P10_2, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P10_2_SCB1_SPI_CLK)},
    {P11_2, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P11_2_SCB5_SPI_CLK)},
};

/* Connections for: scb_spi_miso */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_miso[11] = {
    {P0_3, &CY_SCB_0, CY_PIN_IN_FUNCTION(P0_3_SCB0_SPI_MISO)},
    {P2_1, &CY_SCB_1, CY_PIN_IN_FUNCTION(P2_1_SCB1_SPI_MISO)},
    {P3_1, &CY_SCB_2, CY_PIN_IN_FUNCTION(P3_1_SCB2_SPI_MISO)},
    {P5_1, &CY_SCB_5, CY_PIN_IN_FUNCTION(P5_1_SCB5_SPI_MISO)},
    {P6_5, &CY_SCB_6, CY_PIN_IN_FUNCTION(P6_5_SCB6_SPI_MISO)},
    {P6_5, &CY_SCB_8, CY_PIN_IN_FUNCTION(P6_5_SCB8_SPI_MISO)},
    {P7_1, &CY_SCB_4, CY_PIN_IN_FUNCTION(P7_1_SCB4_SPI_MISO)},
    {P8_1, &CY_SCB_4, CY_PIN_IN_FUNCTION(P8_1_SCB4_SPI_MISO)},
    {P9_1, &CY_SCB_2, CY_PIN_IN_FUNCTION(P9_1_SCB2_SPI_MISO)},
    {P10_1, &CY_SCB_1, CY_PIN_IN_FUNCTION(P10_1_SCB1_SPI_MISO)},
    {P11_1, &CY_SCB_5, CY_PIN_IN_FUNCTION(P11_1_SCB5_SPI_MISO)},
};

/* Connections for: scb_spi_mosi */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_mosi[11] = {
    {P0_2, &CY_SCB_0, CY_PIN_OUT_FUNCTION(P0_2_SCB0_SPI_MOSI)},
    {P2_0, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P2_0_SCB1_SPI_MOSI)},
    {P3_0, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P3_0_SCB2_SPI_MOSI)},
    {P5_0, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P5_0_SCB5_SPI_MOSI)},
    {P6_4, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P6_4_SCB6_SPI_MOSI)},
    {P6_4, &CY_SCB_8, CY_PIN_OUT_FUNCTION(P6_4_SCB8_SPI_MOSI)},
    {P7_0, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P7_0_SCB4_SPI_MOSI)},
    {P8_0, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P8_0_SCB4_SPI_MOSI)},
    {P9_0, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P9_0_SCB2_SPI_MOSI)},
    {P10_0, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P10_0_SCB1_SPI_MOSI)},
    {P11_0, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P11_0_SCB5_SPI_MOSI)},
};

/* Connections for: scb_spi_select0 */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_select0[10] = {
    {P0_5, &CY_SCB_0, CY_PIN_OUT_FUNCTION(P0_5_SCB0_SPI_SELECT0)},
    {P2_3, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P2_3_SCB1_SPI_SELECT0)},
    {P6_3, &CY_SCB_3, CY_PIN_OUT_FUNCTION(P6_3_SCB3_SPI_SELECT0)},
    {P6_3, &CY_SCB_8, CY_PIN_OUT_FUNCTION(P6_3_SCB8_SPI_SELECT0)},
    {P6_7, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P6_7_SCB6_SPI_SELECT0)},
    {P6_7, &CY_SCB_8, CY_PIN_OUT_FUNCTION(P6_7_SCB8_SPI_SELECT0)},
    {P7_3, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P7_3_SCB4_SPI_SELECT0)},
    {P9_3, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P9_3_SCB2_SPI_SELECT0)},
    {P10_3, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P10_3_SCB1_SPI_SELECT0)},
    {P11_3, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P11_3_SCB5_SPI_SELECT0)},
};

/* Connections for: scb_spi_select1 */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_select1[5] = {
    {P0_0, &CY_SCB_0, CY_PIN_OUT_FUNCTION(P0_0_SCB0_SPI_SELECT1)},
    {P2_4, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P2_4_SCB1_SPI_SELECT1)},
    {P7_7, &CY_SCB_3, CY_PIN_OUT_FUNCTION(P7_7_SCB3_SPI_SELECT1)},
    {P10_4, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P10_4_SCB1_SPI_SELECT1)},
    {P11_4, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P11_4_SCB5_SPI_SELECT1)},
};

/* Connections for: scb_spi_select2 */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_select2[4] = {
    {P0_1, &CY_SCB_0, CY_PIN_OUT_FUNCTION(P0_1_SCB0_SPI_SELECT2)},
    {P2_5, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P2_5_SCB1_SPI_SELECT2)},
    {P10_5, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P10_5_SCB1_SPI_SELECT2)},
    {P11_5, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P11_5_SCB5_SPI_SELECT2)},
};

/* Connections for: scb_spi_select3 */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_select3[5] = {
    {P2_6, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P2_6_SCB1_SPI_SELECT3)},
    {P5_6, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P5_6_SCB5_SPI_SELECT3)},
    {P5_7, &CY_SCB_3, CY_PIN_OUT_FUNCTION(P5_7_SCB3_SPI_SELECT3)},
    {P11_6, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P11_6_SCB5_SPI_SELECT3)},
    {P12_6, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P12_6_SCB6_SPI_SELECT3)},
};

/* Connections for: scb_uart_cts */
const cy_resource_pin_mapping_t cy_pin_map_scb_uart_cts[10] = {
    {P0_5, &CY_SCB_0, CY_PIN_IN_FUNCTION(P0_5_SCB0_UART_CTS)},
    {P2_3, &CY_SCB_1, CY_PIN_IN_FUNCTION(P2_3_SCB1_UART_CTS)},
    {P2_7, &CY_SCB_9, CY_PIN_IN_FUNCTION(P2_7_SCB9_UART_CTS)},
    {P5_7, &CY_SCB_10, CY_PIN_IN_FUNCTION(P5_7_SCB10_UART_CTS)},
    {P6_3, &CY_SCB_3, CY_PIN_IN_FUNCTION(P6_3_SCB3_UART_CTS)},
    {P6_7, &CY_SCB_6, CY_PIN_IN_FUNCTION(P6_7_SCB6_UART_CTS)},
    {P7_3, &CY_SCB_4, CY_PIN_IN_FUNCTION(P7_3_SCB4_UART_CTS)},
    {P9_3, &CY_SCB_2, CY_PIN_IN_FUNCTION(P9_3_SCB2_UART_CTS)},
    {P10_3, &CY_SCB_1, CY_PIN_IN_FUNCTION(P10_3_SCB1_UART_CTS)},
    {P11_3, &CY_SCB_5, CY_PIN_IN_FUNCTION(P11_3_SCB5_UART_CTS)},
};

