dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/pin_packages/cy_hal_psoc6_02_68_qfn.c
/* Connections for: scb_uart_rts */
const cy_resource_pin_mapping_t cy_pin_map_scb_uart_rts[10] = {
    {P0_4, &CY_SCB_0, CY_PIN_OUT_FUNCTION(P0_4_SCB0_UART_RTS)},
    {P2_2, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P2_2_SCB1_UART_RTS)},
    {P2_6, &CY_SCB_9, CY_PIN_OUT_FUNCTION(P2_6_SCB9_UART_RTS)},
    {P5_6, &CY_SCB_10, CY_PIN_OUT_FUNCTION(P5_6_SCB10_UART_RTS)},
    {P6_2, &CY_SCB_3, CY_PIN_OUT_FUNCTION(P6_2_SCB3_UART_RTS)},
    {P6_6, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P6_6_SCB6_UART_RTS)},
    {P7_2, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P7_2_SCB4_UART_RTS)},
    {P9_2, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P9_2_SCB2_UART_RTS)},
    {P10_2, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P10_2_SCB1_UART_RTS)},
    {P11_2, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P11_2_SCB5_UART_RTS)},
};

/* Connections for: scb_uart_rx */
const cy_resource_pin_mapping_t cy_pin_map_scb_uart_rx[11] = {
    {P0_2, &CY_SCB_0, CY_PIN_IN_FUNCTION(P0_2_SCB0_UART_RX)},
    {P2_0, &CY_SCB_1, CY_PIN_IN_FUNCTION(P2_0_SCB1_UART_RX)},
    {P2_4, &CY_SCB_9, CY_PIN_IN_FUNCTION(P2_4_SCB9_UART_RX)},
    {P3_0, &CY_SCB_2, CY_PIN_IN_FUNCTION(P3_0_SCB2_UART_RX)},
    {P5_0, &CY_SCB_5, CY_PIN_IN_FUNCTION(P5_0_SCB5_UART_RX)},
    {P6_4, &CY_SCB_6, CY_PIN_IN_FUNCTION(P6_4_SCB6_UART_RX)},
    {P7_0, &CY_SCB_4, CY_PIN_IN_FUNCTION(P7_0_SCB4_UART_RX)},
    {P8_0, &CY_SCB_4, CY_PIN_IN_FUNCTION(P8_0_SCB4_UART_RX)},
    {P9_0, &CY_SCB_2, CY_PIN_IN_FUNCTION(P9_0_SCB2_UART_RX)},
    {P10_0, &CY_SCB_1, CY_PIN_IN_FUNCTION(P10_0_SCB1_UART_RX)},
    {P11_0, &CY_SCB_5, CY_PIN_IN_FUNCTION(P11_0_SCB5_UART_RX)},
};

/* Connections for: scb_uart_tx */
const cy_resource_pin_mapping_t cy_pin_map_scb_uart_tx[11] = {
    {P0_3, &CY_SCB_0, CY_PIN_OUT_FUNCTION(P0_3_SCB0_UART_TX)},
    {P2_1, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P2_1_SCB1_UART_TX)},
    {P2_5, &CY_SCB_9, CY_PIN_OUT_FUNCTION(P2_5_SCB9_UART_TX)},
    {P3_1, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P3_1_SCB2_UART_TX)},
    {P5_1, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P5_1_SCB5_UART_TX)},
    {P6_5, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P6_5_SCB6_UART_TX)},
    {P7_1, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P7_1_SCB4_UART_TX)},
    {P8_1, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P8_1_SCB4_UART_TX)},
    {P9_1, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P9_1_SCB2_UART_TX)},
    {P10_1, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P10_1_SCB1_UART_TX)},
    {P11_1, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P11_1_SCB5_UART_TX)},
};

/* Connections for: sdhc_card_cmd */
const cy_resource_pin_mapping_t cy_pin_map_sdhc_card_cmd[1] = {
    {P2_4, &CY_SDHC_0, CY_PIN_OUT_BUF_FUNCTION(P2_4_SDHC0_CARD_CMD)},
};

/* Connections for: sdhc_card_dat_3to0 */
const cy_resource_pin_mapping_t cy_pin_map_sdhc_card_dat_3to0[4] = {
    {P2_0, &CY_SDHC_0, CY_PIN_OUT_BUF_FUNCTION(P2_0_SDHC0_CARD_DAT_3TO00)},
    {P2_1, &CY_SDHC_0, CY_PIN_OUT_BUF_FUNCTION(P2_1_SDHC0_CARD_DAT_3TO01)},
    {P2_2, &CY_SDHC_0, CY_PIN_OUT_BUF_FUNCTION(P2_2_SDHC0_CARD_DAT_3TO02)},
    {P2_3, &CY_SDHC_0, CY_PIN_OUT_BUF_FUNCTION(P2_3_SDHC0_CARD_DAT_3TO03)},
};

/* Connections for: sdhc_card_detect_n */
const cy_resource_pin_mapping_t cy_pin_map_sdhc_card_detect_n[1] = {
    {P2_6, &CY_SDHC_0, CY_PIN_IN_FUNCTION(P2_6_SDHC0_CARD_DETECT_N)},
};

/* Connections for: sdhc_card_if_pwr_en */
const cy_resource_pin_mapping_t cy_pin_map_sdhc_card_if_pwr_en[2] = {
    {P3_1, &CY_SDHC_0, CY_PIN_OUT_FUNCTION(P3_1_SDHC0_CARD_IF_PWR_EN)},
    {P12_6, &CY_SDHC_1, CY_PIN_OUT_FUNCTION(P12_6_SDHC1_CARD_IF_PWR_EN)},
};

/* Connections for: sdhc_card_mech_write_prot */
const cy_resource_pin_mapping_t cy_pin_map_sdhc_card_mech_write_prot[1] = {
    {P2_7, &CY_SDHC_0, CY_PIN_IN_FUNCTION(P2_7_SDHC0_CARD_MECH_WRITE_PROT)},
};

/* Connections for: sdhc_clk_card */
const cy_resource_pin_mapping_t cy_pin_map_sdhc_clk_card[1] = {
    {P2_5, &CY_SDHC_0, CY_PIN_OUT_BUF_FUNCTION(P2_5_SDHC0_CLK_CARD)},
};

/* Connections for: sdhc_io_volt_sel */
const cy_resource_pin_mapping_t cy_pin_map_sdhc_io_volt_sel[2] = {
    {P3_0, &CY_SDHC_0, CY_PIN_OUT_FUNCTION(P3_0_SDHC0_IO_VOLT_SEL)},
    {P12_7, &CY_SDHC_1, CY_PIN_OUT_FUNCTION(P12_7_SDHC1_IO_VOLT_SEL)},
};

/* Connections for: smif_spi_clk */
const cy_resource_pin_mapping_t cy_pin_map_smif_spi_clk[1] = {
    {P11_7, &CY_SMIF_0, CY_PIN_OUT_BUF_FUNCTION(P11_7_SMIF_SPI_CLK)},
};

/* Connections for: smif_spi_data0 */
const cy_resource_pin_mapping_t cy_pin_map_smif_spi_data0[1] = {
    {P11_6, &CY_SMIF_0, CY_PIN_OUT_BUF_FUNCTION(P11_6_SMIF_SPI_DATA0)},
};

/* Connections for: smif_spi_data1 */
const cy_resource_pin_mapping_t cy_pin_map_smif_spi_data1[1] = {
    {P11_5, &CY_SMIF_0, CY_PIN_OUT_BUF_FUNCTION(P11_5_SMIF_SPI_DATA1)},
};

/* Connections for: smif_spi_data2 */
const cy_resource_pin_mapping_t cy_pin_map_smif_spi_data2[1] = {
    {P11_4, &CY_SMIF_0, CY_PIN_OUT_BUF_FUNCTION(P11_4_SMIF_SPI_DATA2)},
};

/* Connections for: smif_spi_data3 */
const cy_resource_pin_mapping_t cy_pin_map_smif_spi_data3[1] = {
    {P11_3, &CY_SMIF_0, CY_PIN_OUT_BUF_FUNCTION(P11_3_SMIF_SPI_DATA3)},
};

/* Connections for: smif_spi_select0 */
const cy_resource_pin_mapping_t cy_pin_map_smif_spi_select0[1] = {
    {P11_2, &CY_SMIF_0, CY_PIN_OUT_FUNCTION(P11_2_SMIF_SPI_SELECT0)},
};

/* Connections for: smif_spi_select1 */
const cy_resource_pin_mapping_t cy_pin_map_smif_spi_select1[1] = {
    {P11_1, &CY_SMIF_0, CY_PIN_OUT_FUNCTION(P11_1_SMIF_SPI_SELECT1)},
};

/* Connections for: smif_spi_select2 */
const cy_resource_pin_mapping_t cy_pin_map_smif_spi_select2[1] = {
    {P11_0, &CY_SMIF_0, CY_PIN_OUT_FUNCTION(P11_0_SMIF_SPI_SELECT2)},
};

/* Connections for: tcpwm_line */
const cy_resource_pin_mapping_t cy_pin_map_tcpwm_line[50] = {
    {P0_0, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P0_0_TCPWM0_LINE0)},
    {P0_0, &CY_TCPWM_1_0, CY_PIN_OUT_FUNCTION(P0_0_TCPWM1_LINE0)},
    {P0_2, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P0_2_TCPWM0_LINE1)},
    {P0_2, &CY_TCPWM_1_1, CY_PIN_OUT_FUNCTION(P0_2_TCPWM1_LINE1)},
    {P0_4, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P0_4_TCPWM0_LINE2)},
    {P0_4, &CY_TCPWM_1_2, CY_PIN_OUT_FUNCTION(P0_4_TCPWM1_LINE2)},
    {P2_0, &CY_TCPWM_0_6, CY_PIN_OUT_FUNCTION(P2_0_TCPWM0_LINE6)},
    {P2_0, &CY_TCPWM_1_15, CY_PIN_OUT_FUNCTION(P2_0_TCPWM1_LINE15)},
    {P2_2, &CY_TCPWM_0_7, CY_PIN_OUT_FUNCTION(P2_2_TCPWM0_LINE7)},
    {P2_2, &CY_TCPWM_1_16, CY_PIN_OUT_FUNCTION(P2_2_TCPWM1_LINE16)},
    {P2_4, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P2_4_TCPWM0_LINE0)},
    {P2_4, &CY_TCPWM_1_17, CY_PIN_OUT_FUNCTION(P2_4_TCPWM1_LINE17)},
    {P2_6, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P2_6_TCPWM0_LINE1)},
    {P2_6, &CY_TCPWM_1_18, CY_PIN_OUT_FUNCTION(P2_6_TCPWM1_LINE18)},
    {P3_0, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P3_0_TCPWM0_LINE2)},
    {P3_0, &CY_TCPWM_1_19, CY_PIN_OUT_FUNCTION(P3_0_TCPWM1_LINE19)},
    {P5_0, &CY_TCPWM_0_4, CY_PIN_OUT_FUNCTION(P5_0_TCPWM0_LINE4)},
    {P5_0, &CY_TCPWM_1_4, CY_PIN_OUT_FUNCTION(P5_0_TCPWM1_LINE4)},
    {P5_6, &CY_TCPWM_0_7, CY_PIN_OUT_FUNCTION(P5_6_TCPWM0_LINE7)},
    {P5_6, &CY_TCPWM_1_7, CY_PIN_OUT_FUNCTION(P5_6_TCPWM1_LINE7)},
    {P6_2, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P6_2_TCPWM0_LINE1)},
    {P6_2, &CY_TCPWM_1_9, CY_PIN_OUT_FUNCTION(P6_2_TCPWM1_LINE9)},
    {P6_4, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P6_4_TCPWM0_LINE2)},
    {P6_4, &CY_TCPWM_1_10, CY_PIN_OUT_FUNCTION(P6_4_TCPWM1_LINE10)},
    {P6_6, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P6_6_TCPWM0_LINE3)},
    {P6_6, &CY_TCPWM_1_11, CY_PIN_OUT_FUNCTION(P6_6_TCPWM1_LINE11)},
    {P7_0, &CY_TCPWM_0_4, CY_PIN_OUT_FUNCTION(P7_0_TCPWM0_LINE4)},
    {P7_0, &CY_TCPWM_1_12, CY_PIN_OUT_FUNCTION(P7_0_TCPWM1_LINE12)},
    {P7_2, &CY_TCPWM_0_5, CY_PIN_OUT_FUNCTION(P7_2_TCPWM0_LINE5)},
    {P7_2, &CY_TCPWM_1_13, CY_PIN_OUT_FUNCTION(P7_2_TCPWM1_LINE13)},
    {P8_0, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P8_0_TCPWM0_LINE0)},
    {P8_0, &CY_TCPWM_1_16, CY_PIN_OUT_FUNCTION(P8_0_TCPWM1_LINE16)},
    {P9_0, &CY_TCPWM_0_4, CY_PIN_OUT_FUNCTION(P9_0_TCPWM0_LINE4)},
    {P9_0, &CY_TCPWM_1_20, CY_PIN_OUT_FUNCTION(P9_0_TCPWM1_LINE20)},
    {P9_2, &CY_TCPWM_0_5, CY_PIN_OUT_FUNCTION(P9_2_TCPWM0_LINE5)},
    {P9_2, &CY_TCPWM_1_21, CY_PIN_OUT_FUNCTION(P9_2_TCPWM1_LINE21)},
    {P10_0, &CY_TCPWM_0_6, CY_PIN_OUT_FUNCTION(P10_0_TCPWM0_LINE6)},
    {P10_0, &CY_TCPWM_1_22, CY_PIN_OUT_FUNCTION(P10_0_TCPWM1_LINE22)},
    {P10_2, &CY_TCPWM_0_7, CY_PIN_OUT_FUNCTION(P10_2_TCPWM0_LINE7)},
    {P10_2, &CY_TCPWM_1_23, CY_PIN_OUT_FUNCTION(P10_2_TCPWM1_LINE23)},
    {P10_4, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P10_4_TCPWM0_LINE0)},
    {P10_4, &CY_TCPWM_1_0, CY_PIN_OUT_FUNCTION(P10_4_TCPWM1_LINE0)},
    {P11_0, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P11_0_TCPWM0_LINE1)},
    {P11_0, &CY_TCPWM_1_1, CY_PIN_OUT_FUNCTION(P11_0_TCPWM1_LINE1)},
    {P11_2, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P11_2_TCPWM0_LINE2)},
    {P11_2, &CY_TCPWM_1_2, CY_PIN_OUT_FUNCTION(P11_2_TCPWM1_LINE2)},
    {P11_4, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P11_4_TCPWM0_LINE3)},
    {P11_4, &CY_TCPWM_1_3, CY_PIN_OUT_FUNCTION(P11_4_TCPWM1_LINE3)},
    {P12_6, &CY_TCPWM_0_7, CY_PIN_OUT_FUNCTION(P12_6_TCPWM0_LINE7)},
    {P12_6, &CY_TCPWM_1_7, CY_PIN_OUT_FUNCTION(P12_6_TCPWM1_LINE7)},
};

/* Connections for: tcpwm_line_compl */
const cy_resource_pin_mapping_t cy_pin_map_tcpwm_line_compl[52] = {
    {P0_1, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P0_1_TCPWM0_LINE_COMPL0)},
    {P0_1, &CY_TCPWM_1_0, CY_PIN_OUT_FUNCTION(P0_1_TCPWM1_LINE_COMPL0)},
    {P0_3, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P0_3_TCPWM0_LINE_COMPL1)},
    {P0_3, &CY_TCPWM_1_1, CY_PIN_OUT_FUNCTION(P0_3_TCPWM1_LINE_COMPL1)},
    {P0_5, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P0_5_TCPWM0_LINE_COMPL2)},
    {P0_5, &CY_TCPWM_1_2, CY_PIN_OUT_FUNCTION(P0_5_TCPWM1_LINE_COMPL2)},
    {P2_1, &CY_TCPWM_0_6, CY_PIN_OUT_FUNCTION(P2_1_TCPWM0_LINE_COMPL6)},
    {P2_1, &CY_TCPWM_1_15, CY_PIN_OUT_FUNCTION(P2_1_TCPWM1_LINE_COMPL15)},
    {P2_3, &CY_TCPWM_0_7, CY_PIN_OUT_FUNCTION(P2_3_TCPWM0_LINE_COMPL7)},
    {P2_3, &CY_TCPWM_1_16, CY_PIN_OUT_FUNCTION(P2_3_TCPWM1_LINE_COMPL16)},
    {P2_5, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P2_5_TCPWM0_LINE_COMPL0)},
    {P2_5, &CY_TCPWM_1_17, CY_PIN_OUT_FUNCTION(P2_5_TCPWM1_LINE_COMPL17)},
    {P2_7, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P2_7_TCPWM0_LINE_COMPL1)},
    {P2_7, &CY_TCPWM_1_18, CY_PIN_OUT_FUNCTION(P2_7_TCPWM1_LINE_COMPL18)},
    {P3_1, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P3_1_TCPWM0_LINE_COMPL2)},
    {P3_1, &CY_TCPWM_1_19, CY_PIN_OUT_FUNCTION(P3_1_TCPWM1_LINE_COMPL19)},
    {P5_1, &CY_TCPWM_0_4, CY_PIN_OUT_FUNCTION(P5_1_TCPWM0_LINE_COMPL4)},
    {P5_1, &CY_TCPWM_1_4, CY_PIN_OUT_FUNCTION(P5_1_TCPWM1_LINE_COMPL4)},
    {P5_7, &CY_TCPWM_0_7, CY_PIN_OUT_FUNCTION(P5_7_TCPWM0_LINE_COMPL7)},
    {P5_7, &CY_TCPWM_1_7, CY_PIN_OUT_FUNCTION(P5_7_TCPWM1_LINE_COMPL7)},
    {P6_3, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P6_3_TCPWM0_LINE_COMPL1)},
    {P6_3, &CY_TCPWM_1_9, CY_PIN_OUT_FUNCTION(P6_3_TCPWM1_LINE_COMPL9)},
    {P6_5, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P6_5_TCPWM0_LINE_COMPL2)},
    {P6_5, &CY_TCPWM_1_10, CY_PIN_OUT_FUNCTION(P6_5_TCPWM1_LINE_COMPL10)},
    {P6_7, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P6_7_TCPWM0_LINE_COMPL3)},
    {P6_7, &CY_TCPWM_1_11, CY_PIN_OUT_FUNCTION(P6_7_TCPWM1_LINE_COMPL11)},
    {P7_1, &CY_TCPWM_0_4, CY_PIN_OUT_FUNCTION(P7_1_TCPWM0_LINE_COMPL4)},
    {P7_1, &CY_TCPWM_1_12, CY_PIN_OUT_FUNCTION(P7_1_TCPWM1_LINE_COMPL12)},
    {P7_3, &CY_TCPWM_0_5, CY_PIN_OUT_FUNCTION(P7_3_TCPWM0_LINE_COMPL5)},
    {P7_3, &CY_TCPWM_1_13, CY_PIN_OUT_FUNCTION(P7_3_TCPWM1_LINE_COMPL13)},
    {P7_7, &CY_TCPWM_0_7, CY_PIN_OUT_FUNCTION(P7_7_TCPWM0_LINE_COMPL7)},
    {P7_7, &CY_TCPWM_1_15, CY_PIN_OUT_FUNCTION(P7_7_TCPWM1_LINE_COMPL15)},
    {P8_1, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P8_1_TCPWM0_LINE_COMPL0)},
    {P8_1, &CY_TCPWM_1_16, CY_PIN_OUT_FUNCTION(P8_1_TCPWM1_LINE_COMPL16)},
    {P9_1, &CY_TCPWM_0_4, CY_PIN_OUT_FUNCTION(P9_1_TCPWM0_LINE_COMPL4)},
    {P9_1, &CY_TCPWM_1_20, CY_PIN_OUT_FUNCTION(P9_1_TCPWM1_LINE_COMPL20)},
    {P9_3, &CY_TCPWM_0_5, CY_PIN_OUT_FUNCTION(P9_3_TCPWM0_LINE_COMPL5)},
    {P9_3, &CY_TCPWM_1_21, CY_PIN_OUT_FUNCTION(P9_3_TCPWM1_LINE_COMPL21)},
    {P10_1, &CY_TCPWM_0_6, CY_PIN_OUT_FUNCTION(P10_1_TCPWM0_LINE_COMPL6)},
    {P10_1, &CY_TCPWM_1_22, CY_PIN_OUT_FUNCTION(P10_1_TCPWM1_LINE_COMPL22)},
    {P10_3, &CY_TCPWM_0_7, CY_PIN_OUT_FUNCTION(P10_3_TCPWM0_LINE_COMPL7)},
    {P10_3, &CY_TCPWM_1_23, CY_PIN_OUT_FUNCTION(P10_3_TCPWM1_LINE_COMPL23)},
    {P10_5, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P10_5_TCPWM0_LINE_COMPL0)},
    {P10_5, &CY_TCPWM_1_0, CY_PIN_OUT_FUNCTION(P10_5_TCPWM1_LINE_COMPL0)},
    {P11_1, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P11_1_TCPWM0_LINE_COMPL1)},
    {P11_1, &CY_TCPWM_1_1, CY_PIN_OUT_FUNCTION(P11_1_TCPWM1_LINE_COMPL1)},
    {P11_3, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P11_3_TCPWM0_LINE_COMPL2)},
    {P11_3, &CY_TCPWM_1_2, CY_PIN_OUT_FUNCTION(P11_3_TCPWM1_LINE_COMPL2)},
    {P11_5, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P11_5_TCPWM0_LINE_COMPL3)},
    {P11_5, &CY_TCPWM_1_3, CY_PIN_OUT_FUNCTION(P11_5_TCPWM1_LINE_COMPL3)},
    {P12_7, &CY_TCPWM_0_7, CY_PIN_OUT_FUNCTION(P12_7_TCPWM0_LINE_COMPL7)},
    {P12_7, &CY_TCPWM_1_7, CY_PIN_OUT_FUNCTION(P12_7_TCPWM1_LINE_COMPL7)},
};

#endif
